10bulls/zumo1/libraries/boards.txt
teensy31py.name=Teensy 3.1+Python
teensy31py.upload.protocol=halfkay
teensy31py.upload.maximum_size=262144
teensy31py.upload.maximum_ram_size=65536
teensy31py.upload.speed=12000000
teensy31py.upload.disable_flushing=true
teensy31py.bootloader.path=undefined
teensy31py.serial.restart_cmd=true
teensy31py.serial.safe_baud_rates_only=true
teensy31py.upload.avrdude_wrapper=teensy_reboot
teensy31py.build.mcu=mk20dx256
teensy31py.build.cpu=cortex-m4
teensy31py.build.option1=-mthumb
teensy31py.build.option2=-nodefaultlibs
teensy31py.build.option3=-D__MK20DX256__
teensy31py.build.option4=-DTEENSYDUINO=117
# teensy31py.build.option5=-std=gnu99
teensy31py.build.cppoption1=-fno-rtti
teensy31py.build.coption1=-std=gnu99
teensy31py.build.linkoption1=-mthumb 
# use this for Visual Micro...
teensy31py.build.linkoption2=-nodefaultlibs
teensy31py.build.linkoption3=-L"C:\devt\arduino\micropython_vs\build"
teensy31py.build.linkoption4=-lmpython
#teensy31py.build.linkoption5=-L"C:\devt\arduino\arduino-1.0.5\hardware\tools\arm-none-eabi\lib\gcc\arm-none-eabi\4.7.2\thumb2"
teensy31py.build.linkoption5=-lgcc
# use this for Arduino IDE...
#teensy31py.build.additionalobject1=C:\devt\arduino\arduino-1.0.5\hardware\tools\arm-none-eabi\arm-none-eabi\lib\libmpython.a
#teensy31py.build.additionalobject1=-larm_cortexM4l_math
teensy31py.build.linkscript=mk20dx256py.ld
teensy31py.build.architecture=arm-none-eabi
teensy31py.build.command.gcc=arm-none-eabi-gcc
teensy31py.build.command.g++=arm-none-eabi-g++
teensy31py.build.command.ar=arm-none-eabi-ar
teensy31py.build.command.objcopy=arm-none-eabi-objcopy
teensy31py.build.command.objdump=arm-none-eabi-objdump
teensy31py.build.command.size=arm-none-eabi-size
teensy31py.build.core=teensy3
#teensy31py.build.default.link.options=-L C:\devt\arduino\arduino-1.0.5\hardware\tools\arm-none-eabi\arm-none-eabi\lib -lmpython
#teensy31py.build.default.link.options=-Os -Wl,--gc-sections -mcpu=cortex-m4 -L"%SOURCE_BUILD_PATH%\teensy31py" -L"C:\devt\arduino\arduino-1.0.5\hardware\tools\arm-none-eabi\arm-none-eabi\lib" -o "%SOURCE_BUILD_PATH%\%SKETCH%.elf"
teensy31py.build.noarchive=true
teensy31py.build.elide_constructors=true
teensy31py.build.gnu0x=true
teensy31py.build.dependency=true
teensy31py.build.time_t=true
#teensy31py.build.linker_relaxation=true
teensy31py.build.post_compile_script=teensy_post_compile
#teensy31py.build.serial_number=true
teensy31py.menu.usb.serial.name=Serial
teensy31py.menu.usb.serial.build.define0=-DUSB_SERIAL
teensy31py.menu.usb.hid.name=Keyboard + Mouse + Joystick
teensy31py.menu.usb.hid.build.define0=-DUSB_HID
teensy31py.menu.usb.hid.fake_serial=teensy_gateway
teensy31py.menu.usb.serialhid.name=Serial + Keyboard + Mouse + Joystick
teensy31py.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
#teensy31py.menu.usb.int_disk.name=Disk(Internal) + Keyboard
#teensy31py.menu.usb.int_disk.build.define0=-DUSB_DISK
#teensy31py.menu.usb.int_disk.fake_serial=teensy_gateway
#teensy31py.menu.usb.int_disk.build.elfpatch=mktinyfat
#teensy31py.menu.usb.sd_disk.name=Disk(SD Card) + Keyboard
#teensy31py.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
#teensy31py.menu.usb.sd_disk.fake_serial=teensy_gateway
teensy31py.menu.usb.midi.name=MIDI
teensy31py.menu.usb.midi.build.define0=-DUSB_MIDI
teensy31py.menu.usb.midi.fake_serial=teensy_gateway
teensy31py.menu.usb.rawhid.name=Raw HID
teensy31py.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensy31py.menu.usb.rawhid.fake_serial=teensy_gateway
teensy31py.menu.usb.flightsim.name=Flight Sim Controls
teensy31py.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensy31py.menu.usb.flightsim.fake_serial=teensy_gateway
teensy31py.menu.speed.96.name=96 MHz (overclock)
teensy31py.menu.speed.48.name=48 MHz
teensy31py.menu.speed.24.name=24 MHz
teensy31py.menu.speed.96.build.f_cpu=96000000
teensy31py.menu.speed.48.build.f_cpu=48000000
teensy31py.menu.speed.24.build.f_cpu=24000000
teensy31py.menu.keys.en-us.name=US English
teensy31py.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensy31py.menu.keys.fr-ca.name=Canadian French
teensy31py.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensy31py.menu.keys.xx-ca.name=Canadian Multilingual
teensy31py.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensy31py.menu.keys.da-da.name=Danish
teensy31py.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensy31py.menu.keys.fi-fi.name=Finnish
teensy31py.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensy31py.menu.keys.fr-fr.name=French
teensy31py.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensy31py.menu.keys.fr-be.name=French Belgian
teensy31py.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensy31py.menu.keys.fr-ch.name=French Swiss
teensy31py.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensy31py.menu.keys.de-de.name=German
teensy31py.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensy31py.menu.keys.de-dm.name=German (Mac)
teensy31py.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensy31py.menu.keys.de-ch.name=German Swiss
teensy31py.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensy31py.menu.keys.is-is.name=Icelandic
teensy31py.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensy31py.menu.keys.en-ie.name=Irish
teensy31py.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensy31py.menu.keys.it-it.name=Italian
teensy31py.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensy31py.menu.keys.no-no.name=Norwegian
teensy31py.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensy31py.menu.keys.pt-pt.name=Portuguese
teensy31py.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensy31py.menu.keys.pt-br.name=Portuguese Brazilian
teensy31py.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensy31py.menu.keys.es-es.name=Spanish
teensy31py.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensy31py.menu.keys.es-mx.name=Spanish Latin America
teensy31py.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensy31py.menu.keys.sv-se.name=Swedish
teensy31py.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensy31py.menu.keys.tr-tr.name=Turkish (partial)
teensy31py.menu.keys.tr-tr.build.define1=-DLAYOUT_TURKISH
teensy31py.menu.keys.en-gb.name=United Kingdom
teensy31py.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensy31py.menu.keys.usint.name=US International
teensy31py.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL
